In [18]:
import pandas as pd
import glob

In [19]:
df = pd.concat([pd.read_csv(f, sep=',') for f in glob.glob('data' + "/AAPL_2*.csv")],
                      ignore_index=True)

In [20]:
df.head()

         Date   Open   High    Low  Close       Volume
0  11/18/2019  66.45  66.86  66.06  66.78   86,803,600
1  11/15/2019  65.92  66.45  65.75  66.44  100,374,680
2  11/14/2019  65.94  66.22  65.53  65.66   89,582,244
3  11/13/2019  65.28  66.20  65.27  66.12  103,270,360
4  11/12/2019  65.39  65.70  65.23  65.49   87,388,920

In [21]:
df.shape

(1008, 6)

In [22]:
df.dtypes

Date       object
Open      float64
High      float64
Low       float64
Close     float64
Volume     object
dtype: object

In [23]:
df['Date'] = pd.to_datetime(df ['Date'])

In [24]:
df.dtypes

Date      datetime64[ns]
Open             float64
High             float64
Low              float64
Close            float64
Volume            object
dtype: object

In [25]:
df.head()

        Date   Open   High    Low  Close       Volume
0 2019-11-18  66.45  66.86  66.06  66.78   86,803,600
1 2019-11-15  65.92  66.45  65.75  66.44  100,374,680
2 2019-11-14  65.94  66.22  65.53  65.66   89,582,244
3 2019-11-13  65.28  66.20  65.27  66.12  103,270,360
4 2019-11-12  65.39  65.70  65.23  65.49   87,388,920

We need to convert the values from string to float type. Otherwise, it won't work.

In [26]:
df['Volume'] = df['Volume'].apply(lambda x: float(x.replace(",", "")))

In [27]:
df.head()

        Date   Open   High    Low  Close       Volume
0 2019-11-18  66.45  66.86  66.06  66.78   86803600.0
1 2019-11-15  65.92  66.45  65.75  66.44  100374680.0
2 2019-11-14  65.94  66.22  65.53  65.66   89582244.0
3 2019-11-13  65.28  66.20  65.27  66.12  103270360.0
4 2019-11-12  65.39  65.70  65.23  65.49   87388920.0

In [33]:
df.dtypes

Date      datetime64[ns]
Open             float64
High             float64
Low              float64
Close            float64
Volume           float64
dtype: object

In [41]:
df = df.sort_values('Date')
df

          Date    Open    High     Low   Close       Volume
250 2018-11-19   47.50   47.68   46.25   46.47  167683484.0
249 2018-11-20   44.59   45.37   43.88   44.25  271301000.0
248 2018-11-21   44.93   45.07   44.14   44.20  124496844.0
247 2018-11-23   43.74   44.15   43.03   43.07   94495884.0
246 2018-11-26   43.56   43.74   42.57   43.66  179994080.0
..         ...     ...     ...     ...     ...          ...
759 2022-11-09  138.50  138.55  134.59  134.87   74917789.0
758 2022-11-10  141.24  146.87  139.50  146.87  118854000.0
757 2022-11-11  145.82  150.01  144.37  149.70   93979672.0
756 2022-11-14  148.97  150.28  147.43  148.28   73374109.0
755 2022-11-15  152.22  153.59  148.56  150.04   89868328.0

[1008 rows x 6 columns]

In [42]:
df.to_csv('data/AAPL.csv',index=False)

In [43]:
new_df = pd.read_csv('data/AAPL.csv')
new_df

            Date    Open    High     Low   Close       Volume
0     2018-11-19   47.50   47.68   46.25   46.47  167683484.0
1     2018-11-20   44.59   45.37   43.88   44.25  271301000.0
2     2018-11-21   44.93   45.07   44.14   44.20  124496844.0
3     2018-11-23   43.74   44.15   43.03   43.07   94495884.0
4     2018-11-26   43.56   43.74   42.57   43.66  179994080.0
...          ...     ...     ...     ...     ...          ...
1003  2022-11-09  138.50  138.55  134.59  134.87   74917789.0
1004  2022-11-10  141.24  146.87  139.50  146.87  118854000.0
1005  2022-11-11  145.82  150.01  144.37  149.70   93979672.0
1006  2022-11-14  148.97  150.28  147.43  148.28   73374109.0
1007  2022-11-15  152.22  153.59  148.56  150.04   89868328.0

[1008 rows x 6 columns]

Trading Inferences by running different algorithms - 

The following battles will be performed between different players. 
For each of these games the different Computer Players will be configured with default hyper parameters

PPO ALgorithm

In [1]:
from stocktrade import *

/opt/homebrew/lib/python3.10/site-packages/tqdm/auto.py:22: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [2]:
#### 6.1 PPO over 10000 time steps
if __name__ == "__main__":
    timesteps = 1000000
    algo = "PPO"
    stocktrade(algo,timesteps)

Failed to detect the name of this notebook, you can set it manually with the WANDB_NOTEBOOK_NAME environment variable to enable code saving.

:

:

A2C Algorithm

In [ ]:
#### 6.1 PPO over 10000 time steps
if __name__ == "__main__":
    timesteps = 100
    algo = "A2C"
    stocktrade(algo,timesteps)

SAC Algorithm

In [ ]:
#### 6.1 PPO over 10000 time steps
if __name__ == "__main__":
    timesteps = 100
    algo = "A2C"
    stocktrade(algo,timesteps)